tutorials/combustion/dieselFoam/aachenBomb/constant/combustionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

Cmix            Cmix [ 0 0 0 0 0 0 0 ] 1;

ignitionProperties1
{
    ignite          off;
    ignitionPoint   ignitionPoint [ 0 1 0 0 0 0 0 ] ( 0.2 0 0.02 );
    timing          timing [ 0 0 1 0 0 0 0 ] 0;
    duration        duration [ 0 0 1 0 0 0 0 ] 1;
}


// ************************************************************************* //
